tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1773_tdd.h
#define PMCON2                        522
#define VREGCON                       523
#define VREGPM0                       524
#define VREGPM1                       525
#define RC1REG                        526
#define TX1REG                        527
#define SP1BRGL                       528
#define SP1BRGH                       529
#define RC1STA                        530
#define RX9D                          531
#define OERR                          532
#define FERR                          533
#define ADDEN                         534
#define CREN                          535
#define SREN                          536
#define RX9                           537
#define SPEN                          538
#define TX1STA                        539
#define TX9D                          540
#define TRMT                          541
#define BRGH                          542
#define SENDB                         543
#define TX1STA_SYNC                   544
#define TXEN                          545
#define TX9                           546
#define CSRC                          547
#define BAUD1CON                      548
#define ABDEN                         549
#define WUE                           550
#define BRG16                         551
#define SCKP                          552
#define RCIDL                         553
#define ABDOVF                        554
#define WPUA                          555
#define WPUA0                         556
#define WPUA1                         557
#define WPUA2                         558
#define WPUA3                         559
#define WPUA4                         560
#define WPUA5                         561
#define WPUA6                         562
#define WPUA7                         563
#define WPUB                          564
#define WPUB0                         565
#define WPUB1                         566
#define WPUB2                         567
#define WPUB3                         568
#define WPUB4                         569
#define WPUB5                         570
#define WPUB6                         571
#define WPUB7                         572
#define WPUC                          573
#define WPUC0                         574
#define WPUC1                         575
#define WPUC2                         576
#define WPUC3                         577
#define WPUC4                         578
#define WPUC5                         579
#define WPUC6                         580
#define WPUC7                         581
#define WPUE                          582
#define WPUE3                         583
#define SSP1BUF                       584
#define BUF                           585
#define BUF0                          586
#define SSP1BUF0                      587
#define BUF1                          588
#define SSP1BUF1                      589
#define BUF2                          590
#define SSP1BUF2                      591
#define BUF3                          592
#define SSP1BUF3                      593
#define BUF4                          594
#define SSP1BUF4                      595
#define BUF5                          596
#define SSP1BUF5                      597
#define BUF6                          598
#define SSP1BUF6                      599
#define BUF7                          600
#define SSP1BUF7                      601
#define ADD0                          602
#define ADD                           603
#define SSP1ADD0                      604
#define SSP1ADD                       605
#define ADD1                          606
#define SSP1ADD1                      607
#define ADD2                          608
#define SSP1ADD2                      609
#define ADD3                          610
#define SSP1ADD3                      611
#define ADD4                          612
#define SSP1ADD4                      613
#define ADD5                          614
#define SSP1ADD5                      615
#define ADD6                          616
#define SSP1ADD6                      617
#define ADD7                          618
#define SSP1ADD7                      619
#define SSP1MSK0                      620
#define SSP1MSK                       621
#define MSK0                          622
#define MSK                           623
#define SSP1MSK1                      624
#define MSK1                          625
#define SSP1MSK2                      626
#define MSK2                          627
#define SSP1MSK3                      628
#define MSK3                          629
#define SSP1MSK4                      630
#define MSK4                          631
#define SSP1MSK5                      632
#define MSK5                          633
#define SSP1MSK6                      634
#define MSK6                          635
#define SSP1MSK7                      636
#define MSK7                          637
#define SSP1STAT                      638
#define BF                            639
#define UA                            640
#define R_nW                          641
#define S                             642
#define P                             643
#define D_nA                          644
#define CKE                           645
#define SMP                           646
#define SSP1CON1                      647
#define SSPM0                         648
#define SSPM                          649
#define SSPM1                         650
#define SSPM2                         651
#define SSPM3                         652
#define CKP                           653
#define SSPEN                         654
#define SSPOV                         655
#define WCOL                          656
#define SSP1CON2                      657
#define SEN                           658
#define RSEN                          659
#define PEN                           660
#define RCEN                          661
#define ACKEN                         662
#define ACKDT                         663
#define ACKSTAT                       664
#define GCEN                          665
#define SSP1CON3                      666
#define DHEN                          667
#define AHEN                          668
#define SBCDE                         669
#define SDAHT                         670
#define BOEN                          671
#define SCIE                          672
#define PCIE                          673
#define ACKTIM                        674
#define MD3CON0                       675
#define MD3BIT                        676
#define MD3CON0_BIT                   677
#define MD3CON0_OPOL                  678
#define MD3OPOL                       679
#define MD3CON0_OUT                   680
#define MD3OUT                        681
#define MD3EN                         682
#define MD3CON0_EN                    683
#define MD3CON1                       684
#define MD3CLSYNC                     685
#define MD3CON1_CLSYNC                686
#define MD3CLPOL                      687
#define MD3CON1_CLPOL                 688
#define MD3CON1_CHSYNC                689
#define MD3CHSYNC                     690
#define MD3CON1_CHPOL                 691
#define MD3CHPOL                      692
#define MD3SRC                        693
#define MD3SRC_MS                     694
#define MD3MS0                        695
#define MD3SRC_MS0                    696
#define MD3MS                         697
#define MD3SRC_MS1                    698
#define MD3MS1                        699
#define MD3SRC_MS2                    700
#define MD3MS2                        701
#define MD3SRC_MS3                    702
#define MD3MS3                        703
#define MD3SRC_MS4                    704
#define MD3MS4                        705
#define MD3CARL                       706
#define MD3CARL_CL0                   707
#define MD3CL                         708
#define MD3CARL_CL                    709
#define MD3CL0                        710
#define MD3CL1                        711
#define MD3CARL_CL1                   712
#define MD3CARL_CL2                   713
#define MD3CL2                        714
#define MD3CARL_CL3                   715
#define MD3CL3                        716
#define MD3CARL_CL4                   717
#define MD3CARH                       718
#define MD3CARH_CH                    719
#define MD3CARH_CH0                   720
#define MD3CH                         721
#define MD3CH0                        722
#define MD3CARH_CH1                   723
#define MD3CH1                        724
#define MD3CARH_CH2                   725
#define MD3CH2                        726
#define MD3CARH_CH3                   727
#define MD3CH3                        728
#define MD3CARH_CH4                   729
#define ODCONA                        730
#define ODCONA_ODA0                   731
#define ODCONA_ODA1                   732
#define ODCONA_ODA2                   733
#define ODCONA_ODA3                   734
#define ODA4                          735
#define ODA5                          736
#define ODA6                          737
#define ODA7                          738
#define ODCONB                        739
#define ODCONB_ODA0                   740
#define ODCONB_ODA1                   741
#define ODCONB_ODA2                   742
#define ODCONB_ODA3                   743
#define ODB4                          744
#define ODB5                          745
#define ODB6                          746
#define ODB7                          747
#define ODCONC                        748
#define ODC0                          749
#define ODC1                          750
#define ODC2                          751
#define ODC3                          752
#define ODC4                          753
#define ODC5                          754
#define ODC6                          755
#define ODC7                          756
#define CCPR1L                        757
#define CCPR1L_RL                     758
#define CCPR1H                        759
#define CCPR1H_RH                     760
#define CCP1CON                       761
#define CCP1CON_MODE                  762
#define CCP1MODE0                     763
#define CCP1CON_MODE0                 764
#define CCP1MODE                      765
#define CCP1MODE1                     766
#define CCP1CON_MODE1                 767
#define CCP1MODE2                     768
#define CCP1CON_MODE2                 769
#define CCP1MODE3                     770
#define CCP1CON_MODE3                 771
#define CCP1CON_FMT                   772
#define CCP1FMT                       773
#define CCP1CON_OUT                   774
#define CCP1OUT                       775
#define CCP1EN                        776
#define CCP1CON_EN                    777
#define CCP1CAP                       778
#define CCP1CTS0                      779
#define CCP1CAP_CTS                   780
#define CCP1CAP_CTS0                  781
#define CCP1CTS                       782
#define CCP1CTS1                      783
#define CCP1CAP_CTS1                  784
#define CCP1CTS2                      785
#define CCP1CAP_CTS2                  786
#define CCP1CTS3                      787
#define CCP1CAP_CTS3                  788
#define CCPR2L                        789
#define CCPR2L_RL                     790
#define CCPR2H                        791
#define CCPR2H_RH                     792
#define CCP2CON                       793
#define CCP2MODE                      794
#define CCP2MODE0                     795
#define CCP2CON_MODE0                 796
#define CCP2CON_MODE                  797
#define CCP2MODE1                     798
#define CCP2CON_MODE1                 799
#define CCP2MODE2                     800
#define CCP2CON_MODE2                 801
#define CCP2MODE3                     802
#define CCP2CON_MODE3                 803
#define CCP2FMT                       804
#define CCP2CON_FMT                   805
#define CCP2OUT                       806
#define CCP2CON_OUT                   807
#define CCP2EN                        808
#define CCP2CON_EN                    809
#define CCP2CAP                       810
#define CCP2CAP_CTS                   811
#define CCP2CAP_CTS0                  812
#define CCP2CTS                       813
#define CCP2CTS0                      814
#define CCP2CAP_CTS1                  815
#define CCP2CTS1                      816
#define CCP2CAP_CTS2                  817
#define CCP2CTS2                      818
#define CCP2CAP_CTS3                  819
#define CCP2CTS3                      820
#define CCPR7L                        821
#define CCPR7L_RL                     822
#define CCPR7H                        823
#define CCPR7H_RH                     824
#define CCP7CON                       825
#define CCP7CON_MODE0                 826
#define CCP7CON_MODE                  827
#define CCP7MODE0                     828
#define CCP7MODE                      829
#define CCP7CON_MODE1                 830
#define CCP7MODE1                     831
#define CCP7CON_MODE2                 832
#define CCP7MODE2                     833
#define CCP7CON_MODE3                 834
#define CCP7MODE3                     835
#define CCP7CON_FMT                   836
#define CCP7FMT                       837
#define CCP7CON_OUT                   838
#define CCP7OUT                       839
#define CCP7EN                        840
#define CCP7CON_EN                    841
#define CCP7CAP                       842
#define CCP7CTS                       843
#define CCP7CAP_CTS0                  844
#define CCP7CAP_CTS                   845
#define CCP7CTS0                      846
#define CCP7CTS1                      847
#define CCP7CAP_CTS1                  848
#define CCP7CTS2                      849
#define CCP7CAP_CTS2                  850
#define CCP7CAP_CTS3                  851
#define CCP7CTS3                      852
#define CCPTMRS1                      853
#define C1TSEL0                       854
#define C1TSEL                        855
#define C1TSEL1                       856
#define C2TSEL0                       857
#define C2TSEL                        858
#define C2TSEL1                       859
#define C7TSEL                        860
#define C7TSEL0                       861
#define C7TSEL1                       862
#define CCPTMRS2                      863
#define P3TSEL                        864
#define P3TSEL0                       865
#define P3TSEL1                       866
#define P4TSEL0                       867
#define P4TSEL                        868
#define P4TSEL1                       869
#define P9TSEL0                       870
#define P9TSEL                        871
#define P9TSEL1                       872
#define SLRCONA                       873
#define SLRA0                         874
#define SLRA1                         875
#define SLRA2                         876
#define SLRA3                         877
#define SLRA4                         878
#define SLRA5                         879
#define SLRA6                         880
#define SLRA7                         881
#define SLRCONB                       882
#define SLRB0                         883
#define SLRB1                         884
#define SLRB2                         885
#define SLRB3                         886
#define SLRB4                         887
#define SLRB5                         888
#define SLRB6                         889
#define SLRB7                         890
#define SLRCONC                       891
#define SLRC0                         892
#define SLRC1                         893
#define SLRC2                         894
#define SLRC3                         895
#define SLRC4                         896
#define SLRC5                         897
#define SLRC6                         898
#define SLRC7                         899
#define MD1CON0                       900
#define MD1BIT                        901
#define MD1CON0_BIT                   902
#define MD1OPOL                       903
#define MD1CON0_OPOL                  904
#define MD1CON0_OUT                   905
#define MD1OUT                        906
#define MD1CON0_EN                    907
#define MD1EN                         908
#define MD1CON1                       909
#define MD1CLSYNC                     910
#define MD1CON1_CLSYNC                911
#define MD1CON1_CLPOL                 912
#define MD1CLPOL                      913
#define MD1CON1_CHSYNC                914
#define MD1CHSYNC                     915
#define MD1CHPOL                      916
#define MD1CON1_CHPOL                 917
#define MD1SRC                        918
#define MD1MS0                        919
#define MD1SRC_MS0                    920
#define MD1MS                         921
#define MD1SRC_MS                     922
#define MD1MS1                        923
#define MD1SRC_MS1                    924
#define MD1MS2                        925
#define MD1SRC_MS2                    926
#define MD1MS3                        927
#define MD1SRC_MS3                    928
#define MD1MS4                        929
#define MD1SRC_MS4                    930
#define MD1CARL                       931
#define MD1CL                         932
#define MD1CARL_CL0                   933
#define MD1CL0                        934
#define MD1CARL_CL                    935
#define MD1CARL_CL1                   936
#define MD1CL1                        937
#define MD1CARL_CL2                   938
#define MD1CL2                        939
#define MD1CARL_CL3                   940
#define MD1CL3                        941
#define MD1CARL_CL4                   942
#define MD1CARH                       943
#define MD1CARH_CH                    944
#define MD1CH                         945
#define MD1CH0                        946
#define MD1CARH_CH0                   947
#define MD1CH1                        948
#define MD1CARH_CH1                   949
#define MD1CH2                        950
#define MD1CARH_CH2                   951
#define MD1CH3                        952
#define MD1CARH_CH3                   953
#define MD1CARH_CH4                   954
#define MD2CON0                       955
#define MD2BIT                        956
#define MD2CON0_BIT                   957
#define MD2CON0_OPOL                  958
#define MD2OPOL                       959
#define MD2CON0_OUT                   960
#define MD2OUT                        961
#define MD2CON0_EN                    962
#define MD2EN                         963
#define MD2CON1                       964
#define MD2CLSYNC                     965
#define MD2CON1_CLSYNC                966
#define MD2CON1_CLPOL                 967
#define MD2CLPOL                      968
#define MD2CON1_CHSYNC                969
#define MD2CHSYNC                     970
#define MD2CHPOL                      971
#define MD2CON1_CHPOL                 972
#define MD2SRC                        973
#define MD2MS                         974
#define MD2MS0                        975
#define MD2SRC_MS0                    976
#define MD2SRC_MS                     977
#define MD2SRC_MS1                    978
#define MD2MS1                        979
#define MD2MS2                        980
#define MD2SRC_MS2                    981
#define MD2MS3                        982
#define MD2SRC_MS3                    983
#define MD2MS4                        984
#define MD2SRC_MS4                    985
#define MD2CARL                       986
#define MD2CARL_CL                    987
#define MD2CL0                        988
#define MD2CARL_CL0                   989
#define MD2CL                         990
#define MD2CARL_CL1                   991
#define MD2CL1                        992
#define MD2CL2                        993
#define MD2CARL_CL2                   994
#define MD2CL3                        995
#define MD2CARL_CL3                   996
#define MD2CARL_CL4                   997
#define MD2CARH                       998
#define MD2CARH_CH0                   999
#define MD2CH0                        1000
#define MD2CARH_CH                    1001
#define MD2CH                         1002
#define MD2CARH_CH1                   1003
#define MD2CH1                        1004
#define MD2CARH_CH2                   1005
#define MD2CH2                        1006
#define MD2CARH_CH3                   1007
#define MD2CH3                        1008
#define MD2CARH_CH4                   1009
#define INLVLA                        1010
#define INLVLA0                       1011
#define INLVLA1                       1012
#define INLVLA2                       1013
#define INLVLA3                       1014
#define INLVLA4                       1015
#define INLVLA5                       1016
#define INLVA6                        1017
#define INLVA7                        1018
#define INLVLB                        1019
#define INLVB0                        1020
#define INLVB1                        1021
#define INLVB2                        1022
#define INLVB3                        1023
#define INLVLB4                       1024
#define INLVLB5                       1025
#define INLVLB6                       1026
#define INLVLB7                       1027
#define INLVLC                        1028
#define INLVLC0                       1029
#define INLVLC1                       1030
#define INLVLC2                       1031
#define INLVLC3                       1032
#define INLVLC4                       1033
#define INLVLC5                       1034
#define INLVLC6                       1035
#define INLVLC7                       1036
#define INLVE                         1037
#define INLVE3                        1038
#define IOCAP                         1039
#define IOCAP0                        1040
#define IOCAP1                        1041
#define IOCAP2                        1042
#define IOCAP3                        1043
#define IOCAP4                        1044
#define IOCAP5                        1045
#define IOCAP6                        1046
#define IOCAP7                        1047
#define IOCAN                         1048
#define IOCAN0                        1049
#define IOCAN1                        1050
#define IOCAN2                        1051
#define IOCAN3                        1052
#define IOCAN4                        1053
#define IOCAN5                        1054
#define IOCAN6                        1055
#define IOCAN7                        1056
#define IOCAF                         1057
#define IOCAF0                        1058
#define IOCAF1                        1059
#define IOCAF2                        1060
#define IOCAF3                        1061
#define IOCAF4                        1062
#define IOCAF5                        1063
#define IOCAF6                        1064
#define IOCAF7                        1065
#define IOCBP                         1066
#define IOCBP0                        1067
#define IOCBP1                        1068
#define IOCBP2                        1069
#define IOCBP3                        1070
#define IOCBP4                        1071
#define IOCBP5                        1072
#define IOCBP6                        1073
#define IOCBP7                        1074
#define IOCBN                         1075
#define IOCBN0                        1076
#define IOCBN1                        1077
#define IOCBN2                        1078
#define IOCBN3                        1079
#define IOCBN4                        1080
#define IOCBN5                        1081
#define IOCBN6                        1082
#define IOCBN7                        1083
#define IOCBF                         1084
#define IOCBF0                        1085
#define IOCBF1                        1086
#define IOCBF2                        1087
#define IOCBF3                        1088
#define IOCBF4                        1089
#define IOCBF5                        1090
