tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1773_tdd.h
#define G1DBF3                        2207
#define COG1DBF_DBF3                  2208
#define G1DBF4                        2209
#define COG1DBF_DBF4                  2210
#define G1DBF5                        2211
#define COG1DBF_DBF5                  2212
#define COG1CON0                      2213
#define COG1CON0_MD                   2214
#define G1MD0                         2215
#define COG1CON0_MD0                  2216
#define G1MD                          2217
#define G1MD1                         2218
#define COG1CON0_MD1                  2219
#define G1MD2                         2220
#define COG1CON0_MD2                  2221
#define COG1CON0_CS0                  2222
#define G1CS                          2223
#define G1CS0                         2224
#define COG1CON0_CS                   2225
#define COG1CON0_CS1                  2226
#define G1CS1                         2227
#define G1LD                          2228
#define COG1CON0_LD                   2229
#define COG1CON0_EN                   2230
#define G1EN                          2231
#define COG1CON1                      2232
#define COG1CON1_POLA                 2233
#define G1POLA                        2234
#define COG1CON1_POLB                 2235
#define G1POLB                        2236
#define COG1CON1_POLC                 2237
#define G1POLC                        2238
#define COG1CON1_POLD                 2239
#define G1POLD                        2240
#define COG1CON1_FDBS                 2241
#define G1FDBS                        2242
#define COG1CON1_RDBS                 2243
#define G1RDBS                        2244
#define COG1RIS0                      2245
#define COG1RIS0_RIS0                 2246
#define G1RIS0                        2247
#define COG1RIS0_RIS1                 2248
#define G1RIS1                        2249
#define COG1RIS0_RIS2                 2250
#define G1RIS2                        2251
#define COG1RIS0_RIS3                 2252
#define G1RIS3                        2253
#define COG1RIS0_RIS4                 2254
#define G1RIS4                        2255
#define COG1RIS0_RIS5                 2256
#define G1RIS5                        2257
#define COG1RIS0_RIS6                 2258
#define G1RIS6                        2259
#define COG1RIS0_RIS7                 2260
#define G1RIS7                        2261
#define COG1RIS1                      2262
#define COG1RIS1_RIS8                 2263
#define G1RIS8                        2264
#define COG1RIS1_RIS9                 2265
#define G1RIS9                        2266
#define G1RIS10                       2267
#define COG1RIS1_RIS10                2268
#define G1RIS11                       2269
#define COG1RIS1_RIS11                2270
#define G1RIS12                       2271
#define COG1RIS1_RIS12                2272
#define G1RIS13                       2273
#define COG1RIS1_RIS13                2274
#define G1RIS14                       2275
#define COG1RIS1_RIS14                2276
#define G1RIS15                       2277
#define COG1RIS1_RIS15                2278
#define COG1RSIM0                     2279
#define G1RSIM0                       2280
#define COG1RSIM0_RSIM0               2281
#define G1RSIM1                       2282
#define COG1RSIM0_RSIM1               2283
#define G1RSIM2                       2284
#define COG1RSIM0_RSIM2               2285
#define G1RSIM3                       2286
#define COG1RSIM0_RSIM3               2287
#define G1RSIM4                       2288
#define COG1RSIM0_RSIM4               2289
#define G1RSIM5                       2290
#define COG1RSIM0_RSIM5               2291
#define G1RSIM6                       2292
#define COG1RSIM0_RSIM6               2293
#define G1RSIM7                       2294
#define COG1RSIM0_RSIM7               2295
#define COG1RSIM1                     2296
#define COG1RSIM1_RSIM8               2297
#define G1RSIM8                       2298
#define COG1RSIM1_RSIM9               2299
#define G1RSIM9                       2300
#define G1RSIM10                      2301
#define COG1RSIM1_RSIM10              2302
#define G1RSIM11                      2303
#define COG1RSIM1_RSIM11              2304
#define G1RSIM12                      2305
#define COG1RSIM1_RSIM12              2306
#define G1RSIM13                      2307
#define COG1RSIM1_RSIM13              2308
#define G1RSIM14                      2309
#define COG1RSIM1_RSIM14              2310
#define G1RSIM15                      2311
#define COG1RSIM1_RSIM15              2312
#define COG1FIS0                      2313
#define G1FIS0                        2314
#define COG1FIS0_FIS0                 2315
#define G1FIS1                        2316
#define COG1FIS0_FIS1                 2317
#define G1FIS2                        2318
#define COG1FIS0_FIS2                 2319
#define G1FIS3                        2320
#define COG1FIS0_FIS3                 2321
#define G1FIS4                        2322
#define COG1FIS0_FIS4                 2323
#define G1FIS5                        2324
#define COG1FIS0_FIS5                 2325
#define G1FIS6                        2326
#define COG1FIS0_FIS6                 2327
#define G1FIS7                        2328
#define COG1FIS0_FIS7                 2329
#define COG1FIS1                      2330
#define G1FIS8                        2331
#define COG1FIS1_FIS8                 2332
#define G1FIS9                        2333
#define COG1FIS1_FIS9                 2334
#define G1FIS10                       2335
#define COG1FIS1_FIS10                2336
#define G1FIS11                       2337
#define COG1FIS1_FIS11                2338
#define G1FIS12                       2339
#define COG1FIS1_FIS12                2340
#define G1FIS13                       2341
#define COG1FIS1_FIS13                2342
#define G1FIS14                       2343
#define COG1FIS1_FIS14                2344
#define G1FIS15                       2345
#define COG1FIS1_FIS15                2346
#define COG1FSIM0                     2347
#define COG1FSIM0_FSIM0               2348
#define G1FSIM0                       2349
#define COG1FSIM0_FSIM1               2350
#define G1FSIM1                       2351
#define COG1FSIM0_FSIM2               2352
#define G1FSIM2                       2353
#define COG1FSIM0_FSIM3               2354
#define G1FSIM3                       2355
#define COG1FSIM0_FSIM4               2356
#define G1FSIM4                       2357
#define COG1FSIM0_FSIM5               2358
#define G1FSIM5                       2359
#define COG1FSIM0_FSIM6               2360
#define G1FSIM6                       2361
#define COG1FSIM0_FSIM7               2362
#define G1FSIM7                       2363
#define COG1FSIM1                     2364
#define COG1FSIM1_FSIM8               2365
#define G1FSIM8                       2366
#define COG1FSIM1_FSIM9               2367
#define G1FSIM9                       2368
#define COG1FSIM1_FSIM10              2369
#define G1FSIM10                      2370
#define COG1FSIM1_FSIM11              2371
#define G1FSIM11                      2372
#define COG1FSIM1_FSIM12              2373
#define G1FSIM12                      2374
#define COG1FSIM1_FSIM13              2375
#define G1FSIM13                      2376
#define COG1FSIM1_FSIM14              2377
#define G1FSIM14                      2378
#define COG1FSIM1_FSIM15              2379
#define G1FSIM15                      2380
#define COG1ASD0                      2381
#define COG1ASD0_ASDAC0               2382
#define G1ASDAC0                      2383
#define COG1ASD0_ASDAC                2384
#define G1ASDAC                       2385
#define COG1ASD0_ASDAC1               2386
#define G1ASDAC1                      2387
#define G1ASDBD0                      2388
#define COG1ASD0_ASDBD0               2389
#define G1ASDBD                       2390
#define COG1ASD0_ASDBD                2391
#define G1ASDBD1                      2392
#define COG1ASD0_ASDBD1               2393
#define G1ASREN                       2394
#define COG1ASD0_ARSEN                2395
#define G1ARSEN                       2396
#define COG1ASD0_ASREN                2397
#define COG1ASD0_ASE                  2398
#define G1ASE                         2399
#define COG1ASD1                      2400
#define COG1ASD1_AS0E                 2401
#define G1AS0E                        2402
#define G1AS1E                        2403
#define COG1ASD1_AS1E                 2404
#define COG1ASD1_AS2E                 2405
#define G1AS2E                        2406
#define COG1ASD1_AS3E                 2407
#define G1AS3E                        2408
#define G1AS4E                        2409
#define COG1ASD1_AS4E                 2410
#define G1AS5E                        2411
#define COG1ASD1_AS5E                 2412
#define G1AS6E                        2413
#define COG1ASD1_AS6E                 2414
#define G1AS7E                        2415
#define COG1ASD1_AS7E                 2416
#define COG1STR                       2417
#define G1STRA                        2418
#define COG1STR_STRA                  2419
#define G1STRB                        2420
#define COG1STR_STRB                  2421
#define G1STRC                        2422
#define COG1STR_STRC                  2423
#define G1STRD                        2424
#define COG1STR_STRD                  2425
#define COG1STR_SDATA                 2426
#define G1SDATA                       2427
#define COG1STR_SDATB                 2428
#define G1SDATB                       2429
#define COG1STR_SDATC                 2430
#define G1SDATC                       2431
#define COG1STR_SDATD                 2432
#define G1SDATD                       2433
#define COG2PHR                       2434
#define G2PHR0                        2435
#define COG2PHR_PHR                   2436
#define COG2PHR_PHR0                  2437
#define G2PHR1                        2438
#define COG2PHR_PHR1                  2439
#define G2PHR2                        2440
#define COG2PHR_PHR2                  2441
#define G2PHR3                        2442
#define COG2PHR_PHR3                  2443
#define G2PHR4                        2444
#define COG2PHR_PHR4                  2445
#define G2PHR5                        2446
#define COG2PHR_PHR5                  2447
#define COG2PHF                       2448
#define COG2PHF_PHF                   2449
#define COG2PHF_PHF0                  2450
#define G2PHF0                        2451
#define COG2PHF_PHF1                  2452
#define G2PHF1                        2453
#define COG2PHF_PHF2                  2454
#define G2PHF2                        2455
#define G2PHF3                        2456
#define COG2PHF_PHF3                  2457
#define COG2PHF_PHF4                  2458
#define G2PHF4                        2459
#define COG2PHF_PHF5                  2460
#define G2PHF5                        2461
#define COG2BLKR                      2462
#define G2BLKR0                       2463
#define COG2BLKR_BLKR                 2464
#define COG2BLKR_BLKR0                2465
#define G2BLKR1                       2466
#define COG2BLKR_BLKR1                2467
#define G2BLKR2                       2468
#define COG2BLKR_BLKR2                2469
#define G2BLKR3                       2470
#define COG2BLKR_BLKR3                2471
#define G2BLKR4                       2472
#define COG2BLKR_BLKR4                2473
#define G2BLKR5                       2474
#define COG2BLKR_BLKR5                2475
#define COG2BLKF                      2476
#define COG2BLKF_BLKF                 2477
#define G2BLKF0                       2478
#define COG2BLKF_BLKF0                2479
#define COG2BLKF_BLKF1                2480
#define G2BLKF1                       2481
#define COG2BLKF_BLKF2                2482
#define G2BLKF2                       2483
#define COG2BLKF_BLKF3                2484
#define G2BLKF3                       2485
#define COG2BLKF_BLKF4                2486
#define G2BLKF4                       2487
#define COG2BLKF_BLKF5                2488
#define G2BLKF5                       2489
#define COG2DBR                       2490
#define COG2DBR_DBR0                  2491
#define G2DBR0                        2492
#define COG2DBR_DBR                   2493
#define COG2DBR_DBR1                  2494
#define G2DBR1                        2495
#define COG2DBR_DBR2                  2496
#define G2DBR2                        2497
#define COG2DBR_DBR3                  2498
#define G2DBR3                        2499
#define COG2DBR_DBR4                  2500
#define G2DBR4                        2501
#define COG2DBR_DBR5                  2502
#define G2DBR5                        2503
#define COG2DBF                       2504
#define G2DBF                         2505
#define G2DBF0                        2506
#define COG2DBF_DBF0                  2507
#define G2DBF1                        2508
#define COG2DBF_DBF1                  2509
#define G2DBF2                        2510
#define COG2DBF_DBF2                  2511
#define G2DBF3                        2512
#define COG2DBF_DBF3                  2513
#define G2DBF4                        2514
#define COG2DBF_DBF4                  2515
#define G2DBF5                        2516
#define COG2DBF_DBF5                  2517
#define COG2CON0                      2518
#define COG2CON0_MD0                  2519
#define G2MD                          2520
#define G2MD0                         2521
#define COG2CON0_MD                   2522
#define COG2CON0_MD1                  2523
#define G2MD1                         2524
#define COG2CON0_MD2                  2525
#define G2MD2                         2526
#define G2CS                          2527
#define COG2CON0_CS                   2528
#define COG2CON0_CS0                  2529
#define G2CS0                         2530
#define COG2CON0_CS1                  2531
#define G2CS1                         2532
#define COG2CON0_LD                   2533
#define G2LD                          2534
#define G2EN                          2535
#define COG2CON0_EN                   2536
#define COG2CON1                      2537
#define G2POLA                        2538
#define COG2CON1_POLA                 2539
#define G2POLB                        2540
#define COG2CON1_POLB                 2541
#define G2POLC                        2542
#define COG2CON1_POLC                 2543
#define G2POLD                        2544
#define COG2CON1_POLD                 2545
#define COG2CON1_FDBS                 2546
#define G2FDBS                        2547
#define G2RDBS                        2548
#define COG2CON1_RDBS                 2549
#define COG2RIS0                      2550
#define G2RIS0                        2551
#define COG2RIS0_RIS0                 2552
#define G2RIS1                        2553
#define COG2RIS0_RIS1                 2554
#define G2RIS2                        2555
#define COG2RIS0_RIS2                 2556
#define G2RIS3                        2557
#define COG2RIS0_RIS3                 2558
#define G2RIS4                        2559
#define COG2RIS0_RIS4                 2560
#define G2RIS5                        2561
#define COG2RIS0_RIS5                 2562
#define G2RIS6                        2563
#define COG2RIS0_RIS6                 2564
#define G2RIS7                        2565
#define COG2RIS0_RIS7                 2566
#define COG2RIS1                      2567
#define COG2RIS1_RIS8                 2568
#define G2RIS8                        2569
#define COG2RIS1_RIS9                 2570
#define G2RIS9                        2571
#define COG2RIS1_RIS10                2572
#define G2RIS10                       2573
#define COG2RIS1_RIS11                2574
#define G2RIS11                       2575
#define COG2RIS1_RIS12                2576
#define G2RIS12                       2577
#define COG2RIS1_RIS13                2578
#define G2RIS13                       2579
#define COG2RIS1_RIS14                2580
#define G2RIS14                       2581
#define COG2RIS1_RIS15                2582
#define G2RIS15                       2583
#define COG2RSIM0                     2584
#define G2RSIM0                       2585
#define COG2RSIM0_RSIM0               2586
#define G2RSIM1                       2587
#define COG2RSIM0_RSIM1               2588
#define G2RSIM2                       2589
#define COG2RSIM0_RSIM2               2590
#define G2RSIM3                       2591
#define COG2RSIM0_RSIM3               2592
#define G2RSIM4                       2593
#define COG2RSIM0_RSIM4               2594
#define G2RSIM5                       2595
#define COG2RSIM0_RSIM5               2596
#define G2RSIM6                       2597
#define COG2RSIM0_RSIM6               2598
#define G2RSIM7                       2599
#define COG2RSIM0_RSIM7               2600
#define COG2RSIM1                     2601
#define G2RSIM8                       2602
#define COG2RSIM1_RSIM8               2603
#define G2RSIM9                       2604
#define COG2RSIM1_RSIM9               2605
#define COG2RSIM1_RSIM10              2606
#define G2RSIM10                      2607
#define COG2RSIM1_RSIM11              2608
#define G2RSIM11                      2609
#define COG2RSIM1_RSIM12              2610
#define G2RSIM12                      2611
#define COG2RSIM1_RSIM13              2612
#define G2RSIM13                      2613
#define COG2RSIM1_RSIM14              2614
#define G2RSIM14                      2615
#define COG2RSIM1_RSIM15              2616
#define G2RSIM15                      2617
#define COG2FIS0                      2618
#define G2FIS0                        2619
#define COG2FIS0_FIS0                 2620
#define G2FIS1                        2621
#define COG2FIS0_FIS1                 2622
#define G2FIS2                        2623
#define COG2FIS0_FIS2                 2624
#define G2FIS3                        2625
#define COG2FIS0_FIS3                 2626
#define G2FIS4                        2627
#define COG2FIS0_FIS4                 2628
#define G2FIS5                        2629
#define COG2FIS0_FIS5                 2630
#define G2FIS6                        2631
#define COG2FIS0_FIS6                 2632
#define G2FIS7                        2633
#define COG2FIS0_FIS7                 2634
#define COG2FIS1                      2635
#define G2FIS8                        2636
#define COG2FIS1_FIS8                 2637
#define G2FIS9                        2638
#define COG2FIS1_FIS9                 2639
#define COG2FIS1_FIS10                2640
#define G2FIS10                       2641
#define COG2FIS1_FIS11                2642
#define G2FIS11                       2643
#define COG2FIS1_FIS12                2644
#define G2FIS12                       2645
#define COG2FIS1_FIS13                2646
#define G2FIS13                       2647
#define COG2FIS1_FIS14                2648
#define G2FIS14                       2649
#define COG2FIS1_FIS15                2650
#define G2FIS15                       2651
#define COG2FSIM0                     2652
#define COG2FSIM0_FSIM0               2653
#define G2FSIM0                       2654
#define COG2FSIM0_FSIM1               2655
#define G2FSIM1                       2656
#define COG2FSIM0_FSIM2               2657
#define G2FSIM2                       2658
#define COG2FSIM0_FSIM3               2659
#define G2FSIM3                       2660
#define G2FSIM4                       2661
#define COG2FSIM0_FSIM4               2662
#define G2FSIM5                       2663
#define COG2FSIM0_FSIM5               2664
#define COG2FSIM0_FSIM6               2665
#define G2FSIM6                       2666
#define G2FSIM7                       2667
#define COG2FSIM0_FSIM7               2668
#define COG2FSIM1                     2669
#define G2FSIM8                       2670
#define COG2FSIM1_FSIM8               2671
#define G2FSIM9                       2672
#define COG2FSIM1_FSIM9               2673
#define G2FSIM10                      2674
#define COG2FSIM1_FSIM10              2675
#define G2FSIM11                      2676
#define COG2FSIM1_FSIM11              2677
#define G2FSIM12                      2678
#define COG2FSIM1_FSIM12              2679
#define G2FSIM13                      2680
#define COG2FSIM1_FSIM13              2681
#define G2FSIM14                      2682
#define COG2FSIM1_FSIM14              2683
#define G2FSIM15                      2684
#define COG2FSIM1_FSIM15              2685
#define COG2ASD0                      2686
#define COG2ASD0_ASDAC0               2687
#define G2ASDAC                       2688
#define COG2ASD0_ASDAC                2689
#define G2ASDAC0                      2690
#define COG2ASD0_ASDAC1               2691
#define G2ASDAC1                      2692
#define COG2ASD0_ASDBD                2693
#define G2ASDBD0                      2694
#define COG2ASD0_ASDBD0               2695
#define G2ASDBD                       2696
#define G2ASDBD1                      2697
#define COG2ASD0_ASDBD1               2698
#define G2ARSEN                       2699
#define COG2ASD0_ARSEN                2700
#define COG2ASD0_ASREN                2701
#define G2ASREN                       2702
#define COG2ASD0_ASE                  2703
#define G2ASE                         2704
#define COG2ASD1                      2705
#define COG2ASD1_AS0E                 2706
#define G2AS0E                        2707
#define G2AS1E                        2708
#define COG2ASD1_AS1E                 2709
#define COG2ASD1_AS2E                 2710
#define G2AS2E                        2711
#define G2AS3E                        2712
#define COG2ASD1_AS3E                 2713
#define COG2ASD1_AS4E                 2714
#define G2AS4E                        2715
#define COG2ASD1_AS5E                 2716
#define G2AS5E                        2717
#define G2AS6E                        2718
#define COG2ASD1_AS6E                 2719
#define COG2ASD1_AS7E                 2720
#define G2AS7E                        2721
#define COG2STR                       2722
#define COG2STR_STRA                  2723
#define G2STRA                        2724
#define COG2STR_STRB                  2725
#define G2STRB                        2726
#define COG2STR_STRC                  2727
#define G2STRC                        2728
#define COG2STR_STRD                  2729
#define G2STRD                        2730
#define COG2STR_SDATA                 2731
#define G2SDATA                       2732
#define COG2STR_SDATB                 2733
#define G2SDATB                       2734
#define COG2STR_SDATC                 2735
#define G2SDATC                       2736
#define COG2STR_SDATD                 2737
#define G2SDATD                       2738
#define PRG1RTSS                      2739
#define RG1RTSS0                      2740
#define PRG1RTSS_RTSS                 2741
#define PRG1RTSS_RTSS0                2742
#define RG1RTSS1                      2743
#define PRG1RTSS_RTSS1                2744
#define RG1RTSS2                      2745
#define PRG1RTSS_RTSS2                2746
#define RG1RTSS3                      2747
#define PRG1RTSS_RTSS3                2748
#define PRG1FTSS                      2749
#define RG1FTSS0                      2750
#define PRG1FTSS_FTSS                 2751
#define PRG1FTSS_FTSS0                2752
#define RG1FTSS1                      2753
#define PRG1FTSS_FTSS1                2754
#define RG1FTSS2                      2755
#define PRG1FTSS_FTSS2                2756
#define RG1FTSS3                      2757
#define PRG1FTSS_FTSS3                2758
#define PRG1INS                       2759
#define PRG1INS_INS                   2760
#define PRG1INS_INS0                  2761
#define RG1INS0                       2762
#define PRG1INS_INS1                  2763
#define RG1INS1                       2764
