tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1773_tdd.h
#define PRG1INS_INS2                  2765
#define RG1INS2                       2766
#define PRG1INS_INS3                  2767
#define RG1INS3                       2768
#define PRG1CON0                      2769
#define PRG1CON0_GO                   2770
#define RG1GO                         2771
#define RG1OS                         2772
#define PRG1CON0_OS                   2773
#define RG1MODE0                      2774
#define RG1MODE                       2775
#define PRG1CON0_MODE                 2776
#define PRG1CON0_MODE0                2777
#define RG1MODE1                      2778
#define PRG1CON0_MODE1                2779
#define PRG1CON0_REDG                 2780
#define RG1REDG                       2781
#define RG1FEDG                       2782
#define PRG1CON0_FEDG                 2783
#define PRG1CON0_EN                   2784
#define RG1EN                         2785
#define PRG1CON1                      2786
#define PRG1CON1_RPOL                 2787
#define RG1RPOL                       2788
#define PRG1CON1_FPOL                 2789
#define RG1FPOL                       2790
#define PRG1CON1_RDY                  2791
#define RG1RDY                        2792
#define PRG1CON2                      2793
#define RG1ISET0                      2794
#define PRG1CON2_ISET                 2795
#define RG1ISET                       2796
#define PRG1CON2_ISET0                2797
#define RG1ISET1                      2798
#define PRG1CON2_ISET1                2799
#define RG1ISET2                      2800
#define PRG1CON2_ISET2                2801
#define RG1ISET3                      2802
#define PRG1CON2_ISET3                2803
#define RG1ISET4                      2804
#define PRG1CON2_ISET4                2805
#define PRG2RTSS                      2806
#define PRG2RTSS_RTSS                 2807
#define RG2RTSS0                      2808
#define PRG2RTSS_RTSS0                2809
#define RG2RTSS1                      2810
#define PRG2RTSS_RTSS1                2811
#define RG2RTSS2                      2812
#define PRG2RTSS_RTSS2                2813
#define RG2RTSS3                      2814
#define PRG2RTSS_RTSS3                2815
#define PRG2FTSS                      2816
#define RG2FTSS0                      2817
#define PRG2FTSS_FTSS                 2818
#define PRG2FTSS_FTSS0                2819
#define RG2FTSS1                      2820
#define PRG2FTSS_FTSS1                2821
#define PRG2FTSS_FTSS2                2822
#define RG2FTSS2                      2823
#define RG2FTSS3                      2824
#define PRG2FTSS_FTSS3                2825
#define PRG2INS                       2826
#define PRG2INS_INS                   2827
#define PRG2INS_INS0                  2828
#define RG2INS0                       2829
#define PRG2INS_INS1                  2830
#define RG2INS1                       2831
#define PRG2INS_INS2                  2832
#define RG2INS2                       2833
#define PRG2INS_INS3                  2834
#define RG2INS3                       2835
#define PRG2CON0                      2836
#define PRG2CON0_GO                   2837
#define RG2GO                         2838
#define PRG2CON0_OS                   2839
#define RG2OS                         2840
#define RG2MODE0                      2841
#define PRG2CON0_MODE0                2842
#define RG2MODE                       2843
#define PRG2CON0_MODE                 2844
#define RG2MODE1                      2845
#define PRG2CON0_MODE1                2846
#define PRG2CON0_REDG                 2847
#define RG2REDG                       2848
#define RG2FEDG                       2849
#define PRG2CON0_FEDG                 2850
#define PRG2CON0_EN                   2851
#define RG2EN                         2852
#define PRG2CON1                      2853
#define PRG2CON1_RPOL                 2854
#define RG2RPOL                       2855
#define PRG2CON1_FPOL                 2856
#define RG2FPOL                       2857
#define PRG2CON1_RDY                  2858
#define RG2RDY                        2859
#define PRG2CON2                      2860
#define PRG2CON2_ISET                 2861
#define RG2ISET0                      2862
#define PRG2CON2_ISET0                2863
#define RG2ISET                       2864
#define RG2ISET1                      2865
#define PRG2CON2_ISET1                2866
#define RG2ISET2                      2867
#define PRG2CON2_ISET2                2868
#define RG2ISET3                      2869
#define PRG2CON2_ISET3                2870
#define PRG2CON2_ISET4                2871
#define RG2ISET4                      2872
#define PRG3RTSS                      2873
#define PRG3RTSS_RTSS0                2874
#define PRG3RTSS_RTSS                 2875
#define RG3RTSS0                      2876
#define PRG3RTSS_RTSS1                2877
#define RG3RTSS1                      2878
#define PRG3RTSS_RTSS2                2879
#define RG3RTSS2                      2880
#define PRG3RTSS_RTSS3                2881
#define RG3RTSS3                      2882
#define PRG3FTSS                      2883
#define PRG3FTSS_FTSS0                2884
#define RG3FTSS0                      2885
#define PRG3FTSS_FTSS                 2886
#define RG3FTSS1                      2887
#define PRG3FTSS_FTSS1                2888
#define RG3FTSS2                      2889
#define PRG3FTSS_FTSS2                2890
#define RG3FTSS3                      2891
#define PRG3FTSS_FTSS3                2892
#define PRG3INS                       2893
#define RG3INS0                       2894
#define PRG3INS_INS0                  2895
#define PRG3INS_INS                   2896
#define RG3INS1                       2897
#define PRG3INS_INS1                  2898
#define PRG3INS_INS2                  2899
#define RG3INS2                       2900
#define RG3INS3                       2901
#define PRG3INS_INS3                  2902
#define PRG3CON0                      2903
#define PRG3CON0_GO                   2904
#define RG3GO                         2905
#define RG3OS                         2906
#define PRG3CON0_OS                   2907
#define PRG3CON0_MODE                 2908
#define RG3MODE                       2909
#define PRG3CON0_MODE0                2910
#define RG3MODE0                      2911
#define PRG3CON0_MODE1                2912
#define RG3MODE1                      2913
#define PRG3CON0_REDG                 2914
#define RG3REDG                       2915
#define PRG3CON0_FEDG                 2916
#define RG3FEDG                       2917
#define PRG3CON0_EN                   2918
#define RG3EN                         2919
#define PRG3CON1                      2920
#define PRG3CON1_RPOL                 2921
#define RG3RPOL                       2922
#define RG3FPOL                       2923
#define PRG3CON1_FPOL                 2924
#define PRG3CON1_RDY                  2925
#define RG3RDY                        2926
#define PRG3CON2                      2927
#define PRG3CON2_ISET                 2928
#define RG3ISET                       2929
#define RG3ISET0                      2930
#define PRG3CON2_ISET0                2931
#define PRG3CON2_ISET1                2932
#define RG3ISET1                      2933
#define RG3ISET2                      2934
#define PRG3CON2_ISET2                2935
#define RG3ISET3                      2936
#define PRG3CON2_ISET3                2937
#define PRG3CON2_ISET4                2938
#define RG3ISET4                      2939
#define COG3PHR                       2940
#define COG3PHR_PHR0                  2941
#define G3PHR0                        2942
#define COG3PHR_PHR                   2943
#define G3PHR1                        2944
#define COG3PHR_PHR1                  2945
#define COG3PHR_PHR2                  2946
#define G3PHR2                        2947
#define COG3PHR_PHR3                  2948
#define G3PHR3                        2949
#define COG3PHR_PHR4                  2950
#define G3PHR4                        2951
#define G3PHR5                        2952
#define COG3PHR_PHR5                  2953
#define COG3PHF                       2954
#define COG3PHF_PHF                   2955
#define G3PHF0                        2956
#define COG3PHF_PHF0                  2957
#define COG3PHF_PHF1                  2958
#define G3PHF1                        2959
#define COG3PHF_PHF2                  2960
#define G3PHF2                        2961
#define COG3PHF_PHF3                  2962
#define G3PHF3                        2963
#define COG3PHF_PHF4                  2964
#define G3PHF4                        2965
#define COG3PHF_PHF5                  2966
#define G3PHF5                        2967
#define COG3BLKR                      2968
#define COG3BLKR_BLKR0                2969
#define G3BLKR0                       2970
#define COG3BLKR_BLKR                 2971
#define COG3BLKR_BLKR1                2972
#define G3BLKR1                       2973
#define COG3BLKR_BLKR2                2974
#define G3BLKR2                       2975
#define COG3BLKR_BLKR3                2976
#define G3BLKR3                       2977
#define COG3BLKR_BLKR4                2978
#define G3BLKR4                       2979
#define COG3BLKR_BLKR5                2980
#define G3BLKR5                       2981
#define COG3BLKF                      2982
#define G3BLKF0                       2983
#define COG3BLKF_BLKF                 2984
#define COG3BLKF_BLKF0                2985
#define G3BLKF1                       2986
#define COG3BLKF_BLKF1                2987
#define G3BLKF2                       2988
#define COG3BLKF_BLKF2                2989
#define G3BLKF3                       2990
#define COG3BLKF_BLKF3                2991
#define G3BLKF4                       2992
#define COG3BLKF_BLKF4                2993
#define G3BLKF5                       2994
#define COG3BLKF_BLKF5                2995
#define COG3DBR                       2996
#define G3DBR0                        2997
#define COG3DBR_DBR0                  2998
#define COG3DBR_DBR                   2999
#define G3DBR1                        3000
#define COG3DBR_DBR1                  3001
#define G3DBR2                        3002
#define COG3DBR_DBR2                  3003
#define G3DBR3                        3004
#define COG3DBR_DBR3                  3005
#define G3DBR4                        3006
#define COG3DBR_DBR4                  3007
#define G3DBR5                        3008
#define COG3DBR_DBR5                  3009
#define COG3DBF                       3010
#define G3DBF                         3011
#define G3DBF0                        3012
#define COG3DBF_DBF0                  3013
#define G3DBF1                        3014
#define COG3DBF_DBF1                  3015
#define G3DBF2                        3016
#define COG3DBF_DBF2                  3017
#define G3DBF3                        3018
#define COG3DBF_DBF3                  3019
#define G3DBF4                        3020
#define COG3DBF_DBF4                  3021
#define G3DBF5                        3022
#define COG3DBF_DBF5                  3023
#define COG3CON0                      3024
#define G3MD                          3025
#define COG3CON0_MD                   3026
#define G3MD0                         3027
#define COG3CON0_MD0                  3028
#define G3MD1                         3029
#define COG3CON0_MD1                  3030
#define COG3CON0_MD2                  3031
#define G3MD2                         3032
#define G3CS                          3033
#define COG3CON0_CS0                  3034
#define G3CS0                         3035
#define COG3CON0_CS                   3036
#define COG3CON0_CS1                  3037
#define G3CS1                         3038
#define COG3CON0_LD                   3039
#define G3LD                          3040
#define G3EN                          3041
#define COG3CON0_EN                   3042
#define COG3CON1                      3043
#define G3POLA                        3044
#define COG3CON1_POLA                 3045
#define G3POLB                        3046
#define COG3CON1_POLB                 3047
#define G3POLC                        3048
#define COG3CON1_POLC                 3049
#define COG3CON1_POLD                 3050
#define G3POLD                        3051
#define G3FDBS                        3052
#define COG3CON1_FDBS                 3053
#define COG3CON1_RDBS                 3054
#define G3RDBS                        3055
#define COG3RIS0                      3056
#define G3RIS0                        3057
#define COG3RIS0_RIS0                 3058
#define G3RIS1                        3059
#define COG3RIS0_RIS1                 3060
#define G3RIS2                        3061
#define COG3RIS0_RIS2                 3062
#define G3RIS3                        3063
#define COG3RIS0_RIS3                 3064
#define G3RIS4                        3065
#define COG3RIS0_RIS4                 3066
#define G3RIS5                        3067
#define COG3RIS0_RIS5                 3068
#define G3RIS6                        3069
#define COG3RIS0_RIS6                 3070
#define G3RIS7                        3071
#define COG3RIS0_RIS7                 3072
#define COG3RIS1                      3073
#define G3RIS9                        3074
#define COG3RIS1_RIS9                 3075
#define G3RIS11                       3076
#define COG3RIS1_RIS11                3077
#define G3RIS12                       3078
#define COG3RIS1_RIS12                3079
#define G3RIS13                       3080
#define COG3RIS1_RIS13                3081
#define G3RIS14                       3082
#define COG3RIS1_RIS14                3083
#define G3RIS15                       3084
#define COG3RIS1_RIS15                3085
#define COG3RSIM0                     3086
#define G3RSIM0                       3087
#define COG3RSIM0_RSIM0               3088
#define G3RSIM1                       3089
#define COG3RSIM0_RSIM1               3090
#define G3RSIM2                       3091
#define COG3RSIM0_RSIM2               3092
#define G3RSIM3                       3093
#define COG3RSIM0_RSIM3               3094
#define G3RSIM4                       3095
#define COG3RSIM0_RSIM4               3096
#define G3RSIM5                       3097
#define COG3RSIM0_RSIM5               3098
#define G3RSIM6                       3099
#define COG3RSIM0_RSIM6               3100
#define G3RSIM7                       3101
#define COG3RSIM0_RSIM7               3102
#define COG3RSIM1                     3103
#define G3RSIM9                       3104
#define COG3RSIM1_RSIM9               3105
#define G3RSIM11                      3106
#define COG3RSIM1_RSIM11              3107
#define G3RSIM12                      3108
#define COG3RSIM1_RSIM12              3109
#define G3RSIM13                      3110
#define COG3RSIM1_RSIM13              3111
#define G3RSIM14                      3112
#define COG3RSIM1_RSIM14              3113
#define G3RSIM15                      3114
#define COG3RSIM1_RSIM15              3115
#define COG3FIS0                      3116
#define COG3FIS0_FIS0                 3117
#define G3FIS0                        3118
#define COG3FIS0_FIS1                 3119
#define G3FIS1                        3120
#define COG3FIS0_FIS2                 3121
#define G3FIS2                        3122
#define COG3FIS0_FIS3                 3123
#define G3FIS3                        3124
#define COG3FIS0_FIS4                 3125
#define G3FIS4                        3126
#define COG3FIS0_FIS5                 3127
#define G3FIS5                        3128
#define COG3FIS0_FIS6                 3129
#define G3FIS6                        3130
#define G3FIS7                        3131
#define COG3FIS0_FIS7                 3132
#define COG3FIS1                      3133
#define G3FIS9                        3134
#define COG3FIS1_FIS9                 3135
#define COG3FIS1_FIS11                3136
#define G3FIS11                       3137
#define G3FIS12                       3138
#define COG3FIS1_FIS12                3139
#define G3FIS13                       3140
#define COG3FIS1_FIS13                3141
#define G3FIS14                       3142
#define COG3FIS1_FIS14                3143
#define G3FIS15                       3144
#define COG3FIS1_FIS15                3145
#define COG3FSIM0                     3146
#define COG3FSIM0_FSIM0               3147
#define G3FSIM0                       3148
#define G3FSIM1                       3149
#define COG3FSIM0_FSIM1               3150
#define COG3FSIM0_FSIM2               3151
#define G3FSIM2                       3152
#define COG3FSIM0_FSIM3               3153
#define G3FSIM3                       3154
#define G3FSIM4                       3155
#define COG3FSIM0_FSIM4               3156
#define COG3FSIM0_FSIM5               3157
#define G3FSIM5                       3158
#define COG3FSIM0_FSIM6               3159
#define G3FSIM6                       3160
#define COG3FSIM0_FSIM7               3161
#define G3FSIM7                       3162
#define COG3FSIM1                     3163
#define COG3FSIM1_FSIM9               3164
#define G3FSIM9                       3165
#define COG3FSIM1_FSIM11              3166
#define G3FSIM11                      3167
#define G3FSIM12                      3168
#define COG3FSIM1_FSIM12              3169
#define COG3FSIM1_FSIM13              3170
#define G3FSIM13                      3171
#define G3FSIM14                      3172
#define COG3FSIM1_FSIM14              3173
#define G3FSIM15                      3174
#define COG3FSIM1_FSIM15              3175
#define COG3ASD0                      3176
#define COG3ASD0_ASDAC0               3177
#define G3ASDAC                       3178
#define G3ASDAC0                      3179
#define COG3ASD0_ASDAC                3180
#define COG3ASD0_ASDAC1               3181
#define G3ASDAC1                      3182
#define G3ASDBD                       3183
#define COG3ASD0_ASDBD                3184
#define G3ASDBD0                      3185
#define COG3ASD0_ASDBD0               3186
#define COG3ASD0_ASDBD1               3187
#define G3ASDBD1                      3188
#define COG3ASD0_ASREN                3189
#define COG3ASD0_ARSEN                3190
#define G3ASREN                       3191
#define G3ARSEN                       3192
#define COG3ASD0_ASE                  3193
#define G3ASE                         3194
#define COG3ASD1                      3195
#define G3AS0E                        3196
#define COG3ASD1_AS0E                 3197
#define G3AS1E                        3198
#define COG3ASD1_AS1E                 3199
#define COG3ASD1_AS2E                 3200
#define G3AS2E                        3201
#define G3AS3E                        3202
#define COG3ASD1_AS3E                 3203
#define G3AS4E                        3204
#define COG3ASD1_AS4E                 3205
#define G3AS5E                        3206
#define COG3ASD1_AS5E                 3207
#define G3AS6E                        3208
#define COG3ASD1_AS6E                 3209
#define COG3ASD1_AS7E                 3210
#define G3AS7E                        3211
#define COG3STR                       3212
#define COG3STR_STRA                  3213
#define G3STRA                        3214
#define COG3STR_STRB                  3215
#define G3STRB                        3216
#define COG3STR_STRC                  3217
#define G3STRC                        3218
#define COG3STR_STRD                  3219
#define G3STRD                        3220
#define COG3STR_SDATA                 3221
#define G3SDATA                       3222
#define COG3STR_SDATB                 3223
#define G3SDATB                       3224
#define COG3STR_SDATC                 3225
#define G3SDATC                       3226
#define COG3STR_SDATD                 3227
#define G3SDATD                       3228
#define CM4CON0                       3229
#define CM4CON0_SYNC                  3230
#define C4SYNC                        3231
#define C4HYS                         3232
#define CM4CON0_HYS                   3233
#define C4SP                          3234
#define C4ZLF                         3235
#define CM4CON0_ZLF                   3236
#define C4POL                         3237
#define CM4CON0_POL                   3238
#define C4OUT                         3239
#define CM4CON0_OUT                   3240
#define C4ON                          3241
#define CM4CON0_ON                    3242
#define CM4CON1                       3243
#define C4INTN                        3244
#define CM4CON1_INTN                  3245
#define CM4CON1_INTP                  3246
#define C4INTP                        3247
#define CM4NSEL                       3248
#define CM4NSEL_NCH                   3249
#define C4NCH0                        3250
#define C4NCH                         3251
#define C4NCH1                        3252
#define C4NCH2                        3253
#define C4NCH3                        3254
#define CM4PSEL                       3255
#define CM4PSEL_PCH0                  3256
#define C4PCH0                        3257
#define C4PCH                         3258
#define CM4PSEL_PCH                   3259
#define CM4PSEL_PCH1                  3260
#define C4PCH1                        3261
#define CM4PSEL_PCH2                  3262
#define C4PCH2                        3263
#define CM4PSEL_PCH3                  3264
#define C4PCH3                        3265
#define CM5CON0                       3266
#define CM5CON0_SYNC                  3267
#define C5SYNC                        3268
#define C5HYS                         3269
#define CM5CON0_HYS                   3270
#define C5SP                          3271
#define CM5CON0_ZLF                   3272
#define C5ZLF                         3273
#define C5POL                         3274
#define CM5CON0_POL                   3275
#define CM5CON0_OUT                   3276
#define C5OUT                         3277
#define CM5CON0_ON                    3278
#define C5ON                          3279
#define CM5CON1                       3280
#define CM5CON1_INTN                  3281
#define C5INTN                        3282
#define CM5CON1_INTP                  3283
#define C5INTP                        3284
#define CM5NSEL                       3285
#define C5NCH                         3286
#define CM5NSEL_NCH                   3287
#define C5NCH0                        3288
#define C5NCH1                        3289
#define C5NCH2                        3290
#define C5NCH3                        3291
#define CM5PSEL                       3292
#define C5PCH                         3293
#define CM5PSEL_PCH                   3294
#define C5PCH0                        3295
#define CM5PSEL_PCH0                  3296
#define C5PCH1                        3297
#define CM5PSEL_PCH1                  3298
#define C5PCH2                        3299
#define CM5PSEL_PCH2                  3300
#define C5PCH3                        3301
#define CM5PSEL_PCH3                  3302
#define CM6CON0                       3303
#define C6SYNC                        3304
#define CM6CON0_SYNC                  3305
#define C6HYS                         3306
#define CM6CON0_HYS                   3307
#define C6SP                          3308
#define CM6CON0_ZLF                   3309
#define C6ZLF                         3310
#define CM6CON0_POL                   3311
#define C6POL                         3312
#define C6OUT                         3313
#define CM6CON0_OUT                   3314
#define CM6CON0_ON                    3315
#define C6ON                          3316
#define CM6CON1                       3317
#define C6INTN                        3318
#define CM6CON1_INTN                  3319
#define CM6CON1_INTP                  3320
#define C6INTP                        3321
#define CM6NSEL                       3322
