tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1773_tdd.h
#define T3GPPS                        3881
#define T5CKIPPS                      3882
#define T5GPPS                        3883
#define T2INPPS                       3884
#define T4INPPS                       3885
#define T6INPPS                       3886
#define T8INPPS                       3887
#define CCP1PPS                       3888
#define CCP2PPS                       3889
#define CCP7PPS                       3890
#define COG1INPPS                     3891
#define COG2INPPS                     3892
#define COG3INPPS                     3893
#define MD1CLPPS                      3894
#define MD1CHPPS                      3895
#define MD1MODPPS                     3896
#define MD2CLPPS                      3897
#define MD2CHPPS                      3898
#define MD2MODPPS                     3899
#define MD3CLPPS                      3900
#define MD3CHPPS                      3901
#define MD3MODPPS                     3902
#define PRG1RPPS                      3903
#define PRG1FPPS                      3904
#define PRG2RPPS                      3905
#define PRG2FPPS                      3906
#define PRG3RPPS                      3907
#define PRG3FPPS                      3908
#define CLCIN0PPS                     3909
#define CLCIN1PPS                     3910
#define CLCIN2PPS                     3911
#define CLCIN3PPS                     3912
#define ADCACTPPS                     3913
#define SSPCLKPPS                     3914
#define SSPDATPPS                     3915
#define SSPSSPPS                      3916
#define RXPPS                         3917
#define CKPPS                         3918
#define RA0PPS                        3919
#define RA1PPS                        3920
#define RA2PPS                        3921
#define RA3PPS                        3922
#define RA4PPS                        3923
#define RA5PPS                        3924
#define RA6PPS                        3925
#define RA7PPS                        3926
#define RB0PPS                        3927
#define RB1PPS                        3928
#define RB2PPS                        3929
#define RB3PPS                        3930
#define RB4PPS                        3931
#define RB5PPS                        3932
#define RB6PPS                        3933
#define RB7PPS                        3934
#define RC0PPS                        3935
#define RC1PPS                        3936
#define RC2PPS                        3937
#define RC3PPS                        3938
#define RC4PPS                        3939
#define RC5PPS                        3940
#define RC6PPS                        3941
#define RC7PPS                        3942
#define CLCDATA                       3943
#define MCLC1OUT                      3944
#define MCLC2OUT                      3945
#define MCLC3OUT                      3946
#define MLC4OUT                       3947
#define CLC1CON                       3948
#define CLC1CON_MODE                  3949
#define LC1MODE0                      3950
#define LC1MODE                       3951
#define CLC1CON_MODE0                 3952
#define LC1MODE1                      3953
#define CLC1CON_MODE1                 3954
#define CLC1CON_MODE2                 3955
#define LC1MODE2                      3956
#define LC1INTN                       3957
#define CLC1CON_INTN                  3958
#define LC1INTP                       3959
#define CLC1CON_INTP                  3960
#define CLC1CON_OUT                   3961
#define LC1OUT                        3962
#define LC1EN                         3963
#define CLC1CON_EN                    3964
#define CLC1POL                       3965
#define LC1G1POL                      3966
#define CLC1POL_G1POL                 3967
#define CLC1POL_G2POL                 3968
#define LC1G2POL                      3969
#define LC1G3POL                      3970
#define CLC1POL_G3POL                 3971
#define LC1G4POL                      3972
#define CLC1POL_G4POL                 3973
#define CLC1POL_POL                   3974
#define LC1POL                        3975
#define CLC1SEL0                      3976
#define CLC1SEL0_D1S0                 3977
#define LC1D1S0                       3978
#define CLC1SEL0_D1S                  3979
#define LC1D1S                        3980
#define CLC1SEL0_D1S1                 3981
#define LC1D1S1                       3982
#define CLC1SEL0_D1S2                 3983
#define LC1D1S2                       3984
#define LC1D1S3                       3985
#define CLC1SEL0_D1S3                 3986
#define CLC1SEL0_D1S4                 3987
#define LC1D1S4                       3988
#define CLC1SEL0_D1S5                 3989
#define LC1D1S5                       3990
#define CLC1SEL1                      3991
#define CLC1SEL1_D2S0                 3992
#define CLC1SEL1_D2S                  3993
#define LC1D2S                        3994
#define LC1D2S0                       3995
#define CLC1SEL1_D2S1                 3996
#define LC1D2S1                       3997
#define CLC1SEL1_D2S2                 3998
#define LC1D2S2                       3999
#define LC1D2S3                       4000
#define CLC1SEL1_D2S3                 4001
#define LC1D2S4                       4002
#define CLC1SEL1_D2S4                 4003
#define LC1D2S5                       4004
#define CLC1SEL1_D2S5                 4005
#define CLC1SEL2                      4006
#define LC1D3S0                       4007
#define CLC1SEL2_D3S                  4008
#define LC1D3S                        4009
#define CLC1SEL2_D3S0                 4010
#define LC1D3S1                       4011
#define CLC1SEL2_D3S1                 4012
#define LC1D3S2                       4013
#define CLC1SEL2_D3S2                 4014
#define LC1D3S3                       4015
#define CLC1SEL2_D3S3                 4016
#define LC1D3S4                       4017
#define CLC1SEL2_D3S4                 4018
#define LC1D3S5                       4019
#define CLC1SEL2_D3S5                 4020
#define CLC1SEL3                      4021
#define CLC1SEL3_D4S                  4022
#define LC1D4S                        4023
#define LC1D4S0                       4024
#define CLC1SEL3_D4S0                 4025
#define CLC1SEL3_D4S1                 4026
#define LC1D4S1                       4027
#define LC1D4S2                       4028
#define CLC1SEL3_D4S2                 4029
#define LC1D4S3                       4030
#define CLC1SEL3_D4S3                 4031
#define LC1D4S4                       4032
#define CLC1SEL3_D4S4                 4033
#define LC1D4S5                       4034
#define CLC1SEL3_D4S5                 4035
#define CLC1GLS0                      4036
#define CLC1GLS0_D1N                  4037
#define LC1G1D1N                      4038
#define CLC1GLS0_D1T                  4039
#define LC1G1D1T                      4040
#define LC1G1D2N                      4041
#define CLC1GLS0_D2N                  4042
#define LC1G1D2T                      4043
#define CLC1GLS0_D2T                  4044
#define CLC1GLS0_D3N                  4045
#define LC1G1D3N                      4046
#define CLC1GLS0_D3T                  4047
#define LC1G1D3T                      4048
#define CLC1GLS0_D4N                  4049
#define LC1G1D4N                      4050
#define CLC1GLS0_D4T                  4051
#define LC1G1D4T                      4052
#define CLC1GLS1                      4053
#define CLC1GLS1_D1N                  4054
#define LC1G2D1N                      4055
#define LC1G2D1T                      4056
#define CLC1GLS1_D1T                  4057
#define CLC1GLS1_D2N                  4058
#define LC1G2D2N                      4059
#define LC1G2D2T                      4060
#define CLC1GLS1_D2T                  4061
#define CLC1GLS1_D3N                  4062
#define LC1G2D3N                      4063
#define LC1G2D3T                      4064
#define CLC1GLS1_D3T                  4065
#define CLC1GLS1_D4N                  4066
#define LC1G2D4N                      4067
#define LC1G2D4T                      4068
#define CLC1GLS1_D4T                  4069
#define CLC1GLS2                      4070
#define CLC1GLS2_D1N                  4071
#define LC1G3D1N                      4072
#define LC1G3D1T                      4073
#define CLC1GLS2_D1T                  4074
#define LC1G3D2N                      4075
#define CLC1GLS2_D2N                  4076
#define LC1G3D2T                      4077
#define CLC1GLS2_D2T                  4078
#define CLC1GLS2_D3N                  4079
#define LC1G3D3N                      4080
#define LC1G3D3T                      4081
#define CLC1GLS2_D3T                  4082
#define LC1G3D4N                      4083
#define CLC1GLS2_D4N                  4084
#define LC1G3D4T                      4085
#define CLC1GLS2_D4T                  4086
#define CLC1GLS3                      4087
#define LC1G4D1N                      4088
#define CLC1GLS3_G4D1N                4089
#define LC1G4D1T                      4090
#define CLC1GLS3_G4D1T                4091
#define CLC1GLS3_G4D2N                4092
#define LC1G4D2N                      4093
#define CLC1GLS3_G4D2T                4094
#define LC1G4D2T                      4095
#define LC1G4D3N                      4096
#define CLC1GLS3_G4D3N                4097
#define LC1G4D3T                      4098
#define CLC1GLS3_G4D3T                4099
#define CLC1GLS3_G4D4N                4100
#define LC1G4D4N                      4101
#define CLC1GLS3_G4D4T                4102
#define LC1G4D4T                      4103
#define CLC2CON                       4104
#define LC2MODE0                      4105
#define CLC2CON_MODE                  4106
#define LC2MODE                       4107
#define CLC2CON_MODE0                 4108
#define LC2MODE1                      4109
#define CLC2CON_MODE1                 4110
#define LC2MODE2                      4111
#define CLC2CON_MODE2                 4112
#define LC2INTN                       4113
#define CLC2CON_INTN                  4114
#define LC2INTP                       4115
#define CLC2CON_INTP                  4116
#define CLC2CON_OUT                   4117
#define LC2OUT                        4118
#define CLC2CON_EN                    4119
#define LC2EN                         4120
#define CLC2POL                       4121
#define LC2G1POL                      4122
#define CLC2POL_G1POL                 4123
#define LC2G2POL                      4124
#define CLC2POL_G2POL                 4125
#define LC2G3POL                      4126
#define CLC2POL_G3POL                 4127
#define LC2G4POL                      4128
#define CLC2POL_G4POL                 4129
#define CLC2POL_POL                   4130
#define LC2POL                        4131
#define CLC2SEL0                      4132
#define CLC2SEL0_D1S                  4133
#define LC2D1S0                       4134
#define CLC2SEL0_D1S0                 4135
#define LC2D1S                        4136
#define LC2D1S1                       4137
#define CLC2SEL0_D1S1                 4138
#define LC2D1S2                       4139
#define CLC2SEL0_D1S2                 4140
#define CLC2SEL0_D1S3                 4141
#define LC2D1S3                       4142
#define LC2D1S4                       4143
#define CLC2SEL0_D1S4                 4144
#define LC2D1S5                       4145
#define CLC2SEL0_D1S5                 4146
#define CLC2SEL1                      4147
#define LC2D2S0                       4148
#define CLC2SEL1_D2S0                 4149
#define LC2D2S                        4150
#define CLC2SEL1_D2S                  4151
#define LC2D2S1                       4152
#define CLC2SEL1_D2S1                 4153
#define LC2D2S2                       4154
#define CLC2SEL1_D2S2                 4155
#define LC2D2S3                       4156
#define CLC2SEL1_D2S3                 4157
#define LC2D2S4                       4158
#define CLC2SEL1_D2S4                 4159
#define LC2D2S5                       4160
#define CLC2SEL1_D2S5                 4161
#define CLC2SEL2                      4162
#define CLC2SEL2_D3S                  4163
#define LC2D3S0                       4164
#define CLC2SEL2_D3S0                 4165
#define LC2D3S                        4166
#define CLC2SEL2_D3S1                 4167
#define LC2D3S1                       4168
#define LC2D3S2                       4169
#define CLC2SEL2_D3S2                 4170
#define LC2D3S3                       4171
#define CLC2SEL2_D3S3                 4172
#define LC2D3S4                       4173
#define CLC2SEL2_D3S4                 4174
#define LC2D3S5                       4175
#define CLC2SEL2_D3S5                 4176
#define CLC2SEL3                      4177
#define LC2D4S0                       4178
#define CLC2SEL3_D4S                  4179
#define CLC2SEL3_D4S0                 4180
#define LC2D4S                        4181
#define LC2D4S1                       4182
#define CLC2SEL3_D4S1                 4183
#define LC2D4S2                       4184
#define CLC2SEL3_D4S2                 4185
#define CLC2SEL3_D4S3                 4186
#define LC2D4S3                       4187
#define LC2D4S4                       4188
#define CLC2SEL3_D4S4                 4189
#define LC2D4S5                       4190
#define CLC2SEL3_D4S5                 4191
#define CLC2GLS0                      4192
#define LC2G1D1N                      4193
#define CLC2GLS0_D1N                  4194
#define CLC2GLS0_D1T                  4195
#define LC2G1D1T                      4196
#define LC2G1D2N                      4197
#define CLC2GLS0_D2N                  4198
#define CLC2GLS0_D2T                  4199
#define LC2G1D2T                      4200
#define LC2G1D3N                      4201
#define CLC2GLS0_D3N                  4202
#define CLC2GLS0_D3T                  4203
#define LC2G1D3T                      4204
#define LC2G1D4N                      4205
#define CLC2GLS0_D4N                  4206
#define CLC2GLS0_D4T                  4207
#define LC2G1D4T                      4208
#define CLC2GLS1                      4209
#define CLC2GLS1_D1N                  4210
#define LC2G2D1N                      4211
#define CLC2GLS1_D1T                  4212
#define LC2G2D1T                      4213
#define CLC2GLS1_D2N                  4214
#define LC2G2D2N                      4215
#define CLC2GLS1_D2T                  4216
#define LC2G2D2T                      4217
#define LC2G2D3N                      4218
#define CLC2GLS1_D3N                  4219
#define LC2G2D3T                      4220
#define CLC2GLS1_D3T                  4221
#define LC2G2D4N                      4222
#define CLC2GLS1_D4N                  4223
#define LC2G2D4T                      4224
#define CLC2GLS1_D4T                  4225
#define CLC2GLS2                      4226
#define LC2G3D1N                      4227
#define CLC2GLS2_D1N                  4228
#define CLC2GLS2_D1T                  4229
#define LC2G3D1T                      4230
#define CLC2GLS2_D2N                  4231
#define LC2G3D2N                      4232
#define LC2G3D2T                      4233
#define CLC2GLS2_D2T                  4234
#define CLC2GLS2_D3N                  4235
#define LC2G3D3N                      4236
#define CLC2GLS2_D3T                  4237
#define LC2G3D3T                      4238
#define CLC2GLS2_D4N                  4239
#define LC2G3D4N                      4240
#define LC2G3D4T                      4241
#define CLC2GLS2_D4T                  4242
#define CLC2GLS3                      4243
#define LC2G4D1N                      4244
#define CLC2GLS3_G4D1N                4245
#define CLC2GLS3_G4D1T                4246
#define LC2G4D1T                      4247
#define CLC2GLS3_G4D2N                4248
#define LC2G4D2N                      4249
#define LC2G4D2T                      4250
#define CLC2GLS3_G4D2T                4251
#define CLC2GLS3_G4D3N                4252
#define LC2G4D3N                      4253
#define CLC2GLS3_G4D3T                4254
#define LC2G4D3T                      4255
#define LC2G4D4N                      4256
#define CLC2GLS3_G4D4N                4257
#define CLC2GLS3_G4D4T                4258
#define LC2G4D4T                      4259
#define CLC3CON                       4260
#define LC3MODE0                      4261
#define CLC3CON_MODE0                 4262
#define CLC3CON_MODE                  4263
#define LC3MODE                       4264
#define LC3MODE1                      4265
#define CLC3CON_MODE1                 4266
#define LC3MODE2                      4267
#define CLC3CON_MODE2                 4268
#define LC3INTN                       4269
#define CLC3CON_INTN                  4270
#define CLC3CON_INTP                  4271
#define LC3INTP                       4272
#define CLC3CON_OUT                   4273
#define LC3OUT                        4274
#define LC3EN                         4275
#define CLC3CON_EN                    4276
#define CLC3POL                       4277
#define LC3G1POL                      4278
#define CLC3POL_G1POL                 4279
#define LC3G2POL                      4280
#define CLC3POL_G2POL                 4281
#define CLC3POL_G3POL                 4282
#define LC3G3POL                      4283
#define LC3G4POL                      4284
#define CLC3POL_G4POL                 4285
#define LC3POL                        4286
#define CLC3POL_POL                   4287
#define CLC3SEL0                      4288
#define CLC3SEL0_D1S0                 4289
#define LC3D1S0                       4290
#define CLC3SEL0_D1S                  4291
#define LC3D1S                        4292
#define LC3D1S1                       4293
#define CLC3SEL0_D1S1                 4294
#define LC3D1S2                       4295
#define CLC3SEL0_D1S2                 4296
#define LC3D1S3                       4297
#define CLC3SEL0_D1S3                 4298
#define LC3D1S4                       4299
#define CLC3SEL0_D1S4                 4300
#define LC3D1S5                       4301
#define CLC3SEL0_D1S5                 4302
#define CLC3SEL1                      4303
#define CLC3SEL1_D2S                  4304
#define CLC3SEL1_D2S0                 4305
#define LC3D2S                        4306
#define LC3D2S0                       4307
#define CLC3SEL1_D2S1                 4308
#define LC3D2S1                       4309
#define CLC3SEL1_D2S2                 4310
#define LC3D2S2                       4311
#define CLC3SEL1_D2S3                 4312
#define LC3D2S3                       4313
#define CLC3SEL1_D2S4                 4314
#define LC3D2S4                       4315
#define CLC3SEL1_D2S5                 4316
#define LC3D2S5                       4317
#define CLC3SEL2                      4318
#define LC3D3S                        4319
#define CLC3SEL2_D3S                  4320
#define LC3D3S0                       4321
#define CLC3SEL2_D3S0                 4322
#define LC3D3S1                       4323
#define CLC3SEL2_D3S1                 4324
#define LC3D3S2                       4325
#define CLC3SEL2_D3S2                 4326
#define LC3D3S3                       4327
#define CLC3SEL2_D3S3                 4328
#define CLC3SEL2_D3S4                 4329
#define LC3D3S4                       4330
#define CLC3SEL2_D3S5                 4331
#define LC3D3S5                       4332
#define CLC3SEL3                      4333
#define CLC3SEL3_D4S0                 4334
#define LC3D4S0                       4335
#define CLC3SEL3_D4S                  4336
#define LC3D4S                        4337
#define LC3D4S1                       4338
#define CLC3SEL3_D4S1                 4339
#define LC3D4S2                       4340
#define CLC3SEL3_D4S2                 4341
#define LC3D4S3                       4342
#define CLC3SEL3_D4S3                 4343
#define LC3D4S4                       4344
#define CLC3SEL3_D4S4                 4345
#define LC3D4S5                       4346
#define CLC3SEL3_D4S5                 4347
#define CLC3GLS0                      4348
#define CLC3GLS0_D1N                  4349
#define LC3G1D1N                      4350
#define LC3G1D1T                      4351
#define CLC3GLS0_D1T                  4352
#define LC3G1D2N                      4353
#define CLC3GLS0_D2N                  4354
#define CLC3GLS0_D2T                  4355
#define LC3G1D2T                      4356
#define CLC3GLS0_D3N                  4357
#define LC3G1D3N                      4358
#define LC3G1D3T                      4359
#define CLC3GLS0_D3T                  4360
#define CLC3GLS0_D4N                  4361
#define LC3G1D4N                      4362
#define CLC3GLS0_D4T                  4363
#define LC3G1D4T                      4364
#define CLC3GLS1                      4365
#define LC3G2D1N                      4366
#define CLC3GLS1_D1N                  4367
#define CLC3GLS1_D1T                  4368
#define LC3G2D1T                      4369
#define LC3G2D2N                      4370
#define CLC3GLS1_D2N                  4371
#define LC3G2D2T                      4372
#define CLC3GLS1_D2T                  4373
#define LC3G2D3N                      4374
#define CLC3GLS1_D3N                  4375
#define CLC3GLS1_D3T                  4376
#define LC3G2D3T                      4377
#define LC3G2D4N                      4378
#define CLC3GLS1_D4N                  4379
#define LC3G2D4T                      4380
#define CLC3GLS1_D4T                  4381
#define CLC3GLS2                      4382
#define LC3G3D1N                      4383
#define CLC3GLS2_D1N                  4384
#define LC3G3D1T                      4385
#define CLC3GLS2_D1T                  4386
#define CLC3GLS2_D2N                  4387
#define LC3G3D2N                      4388
#define CLC3GLS2_D2T                  4389
#define LC3G3D2T                      4390
#define CLC3GLS2_D3N                  4391
#define LC3G3D3N                      4392
#define LC3G3D3T                      4393
#define CLC3GLS2_D3T                  4394
#define CLC3GLS2_D4N                  4395
#define LC3G3D4N                      4396
#define CLC3GLS2_D4T                  4397
#define LC3G3D4T                      4398
#define CLC3GLS3                      4399
#define LC3G4D1N                      4400
#define CLC3GLS3_G4D1N                4401
#define LC3G4D1T                      4402
#define CLC3GLS3_G4D1T                4403
#define LC3G4D2N                      4404
#define CLC3GLS3_G4D2N                4405
#define CLC3GLS3_G4D2T                4406
#define LC3G4D2T                      4407
#define LC3G4D3N                      4408
#define CLC3GLS3_G4D3N                4409
#define CLC3GLS3_G4D3T                4410
#define LC3G4D3T                      4411
#define LC3G4D4N                      4412
#define CLC3GLS3_G4D4N                4413
#define LC3G4D4T                      4414
#define CLC3GLS3_G4D4T                4415
#define CLC4CON                       4416
#define LC4MODE                       4417
#define CLC4CON_MODE                  4418
#define LC4MODE0                      4419
#define CLC4CON_MODE0                 4420
#define LC4MODE1                      4421
#define CLC4CON_MODE1                 4422
#define LC4MODE2                      4423
#define CLC4CON_MODE2                 4424
#define LC4INTN                       4425
#define CLC4CON_INTN                  4426
#define CLC4CON_INTP                  4427
#define LC4INTP                       4428
#define CLC4CON_OUT                   4429
#define LC4OUT                        4430
#define CLC4CON_EN                    4431
#define LC4EN                         4432
#define CLC4POL                       4433
#define CLC4POL_G1POL                 4434
#define LC4G1POL                      4435
#define CLC4POL_G2POL                 4436
#define LC4G2POL                      4437
#define CLC4POL_G3POL                 4438
