tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1773_tdd.h
#define LC4G3POL                      4439
#define LC4G4POL                      4440
#define CLC4POL_G4POL                 4441
#define LC4POL                        4442
#define CLC4POL_POL                   4443
#define CLC4SEL0                      4444
#define CLC4SEL0_D1S0                 4445
#define LC4D1S0                       4446
#define CLC4SEL0_D1S                  4447
#define LC4D1S                        4448
#define CLC4SEL0_D1S1                 4449
#define LC4D1S1                       4450
#define CLC4SEL0_D1S2                 4451
#define LC4D1S2                       4452
#define CLC4SEL0_D1S3                 4453
#define LC4D1S3                       4454
#define CLC4SEL0_D1S4                 4455
#define LC4D1S4                       4456
#define CLC4SEL0_D1S5                 4457
#define LC4D1S5                       4458
#define CLC4SEL1                      4459
#define LC4D2S0                       4460
#define CLC4SEL1_D2S                  4461
#define CLC4SEL1_D2S0                 4462
#define LC4D2S                        4463
#define CLC4SEL1_D2S1                 4464
#define LC4D2S1                       4465
#define LC4D2S2                       4466
#define CLC4SEL1_D2S2                 4467
#define LC4D2S3                       4468
#define CLC4SEL1_D2S3                 4469
#define LC4D2S4                       4470
#define CLC4SEL1_D2S4                 4471
#define LC4D2S5                       4472
#define CLC4SEL1_D2S5                 4473
#define CLC4SEL2                      4474
#define LC4D3S                        4475
#define CLC4SEL2_D3S                  4476
#define CLC4SEL2_D3S0                 4477
#define LC4D3S0                       4478
#define LC4D3S1                       4479
#define CLC4SEL2_D3S1                 4480
#define CLC4SEL2_D3S2                 4481
#define LC4D3S2                       4482
#define CLC4SEL2_D3S3                 4483
#define LC4D3S3                       4484
#define CLC4SEL2_D3S4                 4485
#define LC4D3S4                       4486
#define CLC4SEL2_D3S5                 4487
#define LC4D3S5                       4488
#define CLC4SEL3                      4489
#define LC4D4S0                       4490
#define LC4D4S                        4491
#define CLC4SEL3_D4S0                 4492
#define CLC4SEL3_D4S                  4493
#define LC4D4S1                       4494
#define CLC4SEL3_D4S1                 4495
#define LC4D4S2                       4496
#define CLC4SEL3_D4S2                 4497
#define LC4D4S3                       4498
#define CLC4SEL3_D4S3                 4499
#define LC4D4S4                       4500
#define CLC4SEL3_D4S4                 4501
#define LC4D4S5                       4502
#define CLC4SEL3_D4S5                 4503
#define CLC4GLS0                      4504
#define CLC4GLS0_D1N                  4505
#define LC4G1D1N                      4506
#define CLC4GLS0_D1T                  4507
#define LC4G1D1T                      4508
#define CLC4GLS0_D2N                  4509
#define LC4G1D2N                      4510
#define CLC4GLS0_D2T                  4511
#define LC4G1D2T                      4512
#define CLC4GLS0_D3N                  4513
#define LC4G1D3N                      4514
#define CLC4GLS0_D3T                  4515
#define LC4G1D3T                      4516
#define CLC4GLS0_D4N                  4517
#define LC4G1D4N                      4518
#define CLC4GLS0_D4T                  4519
#define LC4G1D4T                      4520
#define CLC4GLS1                      4521
#define CLC4GLS1_D1N                  4522
#define LC4G2D1N                      4523
#define CLC4GLS1_D1T                  4524
#define LC4G2D1T                      4525
#define LC4G2D2N                      4526
#define CLC4GLS1_D2N                  4527
#define LC4G2D2T                      4528
#define CLC4GLS1_D2T                  4529
#define CLC4GLS1_D3N                  4530
#define LC4G2D3N                      4531
#define LC4G2D3T                      4532
#define CLC4GLS1_D3T                  4533
#define CLC4GLS1_D4N                  4534
#define LC4G2D4N                      4535
#define CLC4GLS1_D4T                  4536
#define LC4G2D4T                      4537
#define CLC4GLS2                      4538
#define CLC4GLS2_D1N                  4539
#define LC4G3D1N                      4540
#define CLC4GLS2_D1T                  4541
#define LC4G3D1T                      4542
#define LC4G3D2N                      4543
#define CLC4GLS2_D2N                  4544
#define LC4G3D2T                      4545
#define CLC4GLS2_D2T                  4546
#define CLC4GLS2_D3N                  4547
#define LC4G3D3N                      4548
#define CLC4GLS2_D3T                  4549
#define LC4G3D3T                      4550
#define LC4G3D4N                      4551
#define CLC4GLS2_D4N                  4552
#define LC4G3D4T                      4553
#define CLC4GLS2_D4T                  4554
#define CLC4GLS3                      4555
#define CLC4GLS3_G4D1N                4556
#define LC4G4D1N                      4557
#define LC4G4D1T                      4558
#define CLC4GLS3_G4D1T                4559
#define LC4G4D2N                      4560
#define CLC4GLS3_G4D2N                4561
#define LC4G4D2T                      4562
#define CLC4GLS3_G4D2T                4563
#define CLC4GLS3_G4D3N                4564
#define LC4G4D3N                      4565
#define CLC4GLS3_G4D3T                4566
#define LC4G4D3T                      4567
#define LC4G4D4N                      4568
#define CLC4GLS3_G4D4N                4569
#define LC4G4D4T                      4570
#define CLC4GLS3_G4D4T                4571
#define STATUS_SHAD                   4572
#define C_SHAD                        4573
#define DC_SHAD                       4574
#define Z_SHAD                        4575
#define WREG_SHAD                     4576
#define BSR_SHAD                      4577
#define PCLATH_SHAD                   4578
#define FSR0L_SHAD                    4579
#define FSR0H_SHAD                    4580
#define FSR1L_SHAD                    4581
#define FSR1H_SHAD                    4582
#define STKPTR                        4583
#define TOSL                          4584
#define TOSH                          4585

#endif // _PIC16F1773_H_
